from vkbottle.bot import Bot

token = '39e100930a0ba2fb4f89d9e576895c8ff9c38e5e17c9887dfacc66ba2aa8916f7714e20d79b9c4b9ea4e4'
bot = Bot(token)
log_id = 2000000003
group_id = -202119303
adm_id = 553709956
db = 'server.db'

# Потребление ресурсов на душу населения в год
cons_fish = 5
cons_stone = 0.4
cons_ore = 0.1
cons_tree = 0.8
cons_silk = 1

# Цена ресурса за шт. Дефицит
price_deficit_fish = 20
price_deficit_stone = 50
price_deficit_ore = 100
price_deficit_tree = 30
price_deficit_silk = 24

# Цена ресурса за шт. Стандарт
price_standart_fish = 10
price_standart_stone = 25
price_standart_ore = 50
price_standart_tree = 15
price_standart_silk = 12

# Цена ресурса за шт. Достаток
price_dostatok_fish = 6
price_dostatok_stone = 15
price_dostatok_ore = 35
price_dostatok_tree = 10
price_dostatok_silk = 8

# Цена ресурса за шт. Изобилие
price_izobilie_fish = 2
price_izobilie_stone = 6
price_izobilie_ore = 20
price_izobilie_tree = 4
price_izobilie_silk = 3

# Заработок нпс-жителя в год
income_npc = 105 # тратит 94

# Предприятия.
price = {}
price['Рыб.Судно'] = {} # Житель потребляет 5 | Прокормит 1500 жителей
price['Рыб.Судно']['дерево'] = 7500
price['Рыб.Судно']['хлопок'] = 4500
price['Рыб.Судно']['работа'] = 31890
price['Рыб.Судно']['зарплата'] = 150
price['Рыб.Судно']['доход'] = 20
# Доход Дефицит = 150000 | Доход Стандарт = 75000 | Доход Достаток = 45000 | Доход Изобилие = 15000

price['Плантация хлопка'] = {} # Житель потребляет 1 | Прокормит 1350 жителей
price['Плантация хлопка']['дерево'] = 2000
price['Плантация хлопка']['хлопок'] = 4000
price['Плантация хлопка']['работа'] = 31890
price['Плантация хлопка']['зарплата'] = 32
price['Плантация хлопка']['доход'] = 4
# Доход Дефицит = 32400 | Доход Стандарт = 16200 | Доход Достаток = 10800 | Доход Изобилие = 4050

price['Лесопилка'] = {} # Житель потребляет 0.8 | Прокормит 1250 жителей
price['Лесопилка']['дерево'] = 2000
price['Лесопилка']['хлопок'] = 1000
price['Лесопилка']['камень'] = 2000
price['Лесопилка']['руда'] = 1000
price['Лесопилка']['работа'] = 21260
price['Лесопилка']['зарплата'] = 35
price['Лесопилка']['доход'] = 3
# Доход Дефицит = 30000 | Доход Стандарт = 15000 | Доход Достаток = 10000 | Доход Изобилие = 4000

price['Каменоломня'] = {} # Житель потребляет 0.4 | Прокормит 1150 жителей
price['Каменоломня']['дерево'] = 2000
price['Каменоломня']['хлопок'] = 1500
price['Каменоломня']['камень'] = 2000
price['Каменоломня']['руда'] = 2000
price['Каменоломня']['работа'] = 45050
price['Каменоломня']['зарплата'] = 33
price['Каменоломня']['доход'] = 2
# Доход Дефицит = 23000 | Доход Стандарт = 11500 | Доход Достаток = 6900 | Доход Изобилие = 2760

price['Шахта'] = {} # Житель потребляет 0.1 | Прокормит 3000 жителей
price['Шахта']['дерево'] = 4500
price['Шахта']['хлопок'] = 2000
price['Шахта']['камень'] = 3500
price['Шахта']['руда'] = 3000
price['Шахта']['работа'] = 75000
price['Шахта']['зарплата'] = 25
price['Шахта']['доход'] = 1
# Доход Дефицит = 30000 | Доход Стандарт = 15000 | Доход Достаток = 10500 | Доход Изобилие = 6000

# Юниты
price['ополченец'] = {}
price['ополченец']['содержание'] = 0.3
price['ополченец']['дерево'] = 1
price['ополченец']['серебро'] = 50
price['ополченец']['хп'] = 50
price['ополченец']['урон'] = 10

price['стрелок'] = {}
price['стрелок']['содержание'] = 0.5
price['стрелок']['дерево'] = 3
price['стрелок']['хлопок'] = 2
price['стрелок']['серебро'] = 150
price['стрелок']['хп'] = 40
price['стрелок']['урон'] = 40

price['всадник'] = {}
price['всадник']['содержание'] = 1
price['всадник']['дерево'] = 3
price['всадник']['руда'] = 5
price['всадник']['хлопок'] = 3
price['всадник']['серебро'] = 200
price['всадник']['хп'] = 150
price['всадник']['урон'] = 40

price['воин'] = {}
price['воин']['содержание'] = 0.5
price['воин']['руда'] = 3
price['воин']['хлопок'] = 2
price['воин']['серебро'] = 150
price['воин']['хп'] = 100
price['воин']['урон'] = 20

price['наемный воин'] = {}
price['наемный воин']['содержание'] = 3
price['наемный воин']['серебро'] = 700
price['наемный воин']['хп'] = 400
price['наемный воин']['урон'] = 10

price['наемный всадник'] = {}
price['наемный всадник']['содержание'] = 10
price['наемный всадник']['серебро'] = 1000
price['наемный всадник']['хп'] = 750
price['наемный всадник']['урон'] = 10

price['наемный стрелок'] = {}
price['наемный стрелок']['содержание'] = 3
price['наемный стрелок']['серебро'] = 600
price['наемный стрелок']['хп'] = 350
price['наемный стрелок']['урон'] = 10